Lines created by massing or picking 3d path are not editable.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CurveNotEditableWarn { get; }
  Visual Basic
Public Shared ReadOnly Property CurveNotEditableWarn As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CurveNotEditableWarn {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures CurveFailures Class
  Autodesk.Revit.DB Namespace